/*投注内容 格式化*/
var matchDic = {
		1 : '周一',
		2 : '周二',
		3 : '周三',
		4 : '周四',
		5 : '周五',
		6 : '周六',
		7 : '周日'
	};
var matchDir={1:'第1场',2:'第2场',3:'第3场',4:'第4场',5:'第5场',6:'第6场',7:'第7场',8:'第8场',9:'第9场',10:'第10场',
		11:'第11场',12:'第12场',13:'第13场',14:'第14场',15:'第15场',16:'第16场',17:'第17场',18:'第18场',19:'第19场',20:'第20场',
		21:'第21场',22:'第22场',23:'第23场',24:'第24场',25:'第25场',26:'第26场',27:'第27场',28:'第28场',29:'第29场',30:'第30场',
		31:'第31场',32:'第32场',33:'第33场',34:'第34场',35:'第35场',36:'第36场',37:'第37场',38:'第38场',39:'第39场',40:'第40场',
		41:'第41场',42:'第42场',43:'第43场',44:'第44场',45:'第45场',46:'第46场',47:'第47场',48:'第48场',49:'第49场',50:'第50场',
		51:'第51场',52:'第52场',53:'第53场',54:'第54场',55:'第55场',56:'第56',57:'第57场',58:'第58场',59:'第59场',60:'第60场',
		61:'第61场',62:'第62场',63:'第63场',64:'第64场',65:'第65场',66:'第66场',67:'第67场',68:'第68场',69:'第69场',70:'第70场',
		71:'第71场',72:'第72场',73:'第73场',74:'第74场',75:'第75场',76:'第76场',77:'第77场',78:'第78场',79:'第79场',80:'第80场',
		81:'第81场',82:'第82场',83:'第83场',84:'第84场',85:'第85场',86:'第86场',87:'第87场',88:'第88场',89:'第89场',90:'第90场',
		91:'第91场',92:'第92场',93:'第93场',94:'第94场',95:'第95场',96:'第96场',97:'第97场',98:'第98场',99:'第99场',100:'第100场',
		101:'第101场',102:'第102场',103:'第103场',104:'第104场',105:'第105场',106:'第106场',107:'第107场',108:'第108场',109:'第109场',200:'第110场',
		111:'第111场',112:'第112场',113:'第113场',114:'第114场',115:'第115场',116:'第116场',117:'第117场',118:'第118场',119:'第119场',120:'第120场',
		121:'第121场',122:'第122场',123:'第123场',124:'第124场',125:'第125场',126:'第126场',127:'第127场',128:'第128场',129:'第129场',130:'第130场',
		131:'第131场',132:'第132场',133:'第133场',134:'第134场',135:'第135场',136:'第136场',137:'第137场',138:'第138场',139:'第139场',140:'第140场',
		141:'第141场',142:'第142场',143:'第143场',144:'第144场',145:'第145场',146:'第146场',147:'第147场',148:'第148场',149:'第149场',150:'第150场',
		151:'第151场',152:'第152场',153:'第153场',154:'第154场',155:'第155场',156:'第156场',157:'第157场',158:'第158场',159:'第159场',160:'第160场',
		161:'第161场',162:'第162场',163:'第163场',164:'第164场',165:'第165场',166:'第166场',167:'第167场',168:'第168场',169:'第169场',170:'第170场',
		171:'第171场',172:'第172场',173:'第173场',174:'第174场',175:'第175场',176:'第176场',177:'第177场',178:'第178场',179:'第179场',180:'第180场',
		181:'第181场',182:'第182场',183:'第183场',184:'第184场',185:'第185场',186:'第186场',187:'第187场',188:'第188场',189:'第189场',190:'第190场',
		191:'第191场',192:'第192场',193:'第193场',194:'第194场',195:'第195场',196:'第196场',197:'第197场',198:'第198场',199:'第199场',200:'第200场'
};//北单
var dic = {
	11001 : {
		'3' : '胜',
		'1' : '平',
		'0' : '负'
	},
	9001 : {
		'3' : '胜',
		'1' : '平',
		'0' : '负'
	},
	9005 : {
		'3' : '胜',
		'1' : '平',
		'0' : '负'
	},
	9002 : {
		'0' : '0',
		'1' : '1',
		'2' : '2',
		'3' : '3',
		'4' : '4',
		'5' : '5',
		'6' : '6',
		'7' : '7+'
	},
	11003 : {
		'1' : '上单',
		'2' : '上双',
		'3' : '下单',
		'4' : '下双'
	},
	11002 : {
		'0' : '0',
		'1' : '1',
		'2' : '2',
		'3' : '3',
		'4' : '4',
		'5' : '5',
		'6' : '6',
		'7' : '7+'
	},
	9003 : {
		'90' : '胜其它',
		'99' : '平其它',
		'09' : '负其它',
		'10' : '1:0',
		'20' : '2:0',
		'21' : '2:1',
		'30' : '3:0',
		'31' : '3:1',
		'32' : '3:2',
		'40' : '4:0',
		'41' : '4:1',
		'42' : '4:2',
		'50' : '5:0',
		'51' : '5:1',
		'52' : '5:2',
		'00' : '0:0',
		'11' : '1:1',
		'22' : '2:2',
		'33' : '3:3',
		'01' : '0:1',
		'02' : '0:2',
		'12' : '1:2',
		'03' : '0:3',
		'13' : '1:3',
		'23' : '2:3',
		'04' : '0:4',
		'14' : '1:4',
		'24' : '2:4',
		'05' : '0:5',
		'15' : '1:5',
		'25' : '2:5'
	},
	11004 : {
		'90' : '胜其它',
		'99' : '平其它',
		'09' : '负其它',
		'10' : '1:0',
		'20' : '2:0',
		'21' : '2:1',
		'30' : '3:0',
		'31' : '3:1',
		'32' : '3:2',
		'40' : '4:0',
		'41' : '4:1',
		'42' : '4:2',
		'50' : '5:0',
		'51' : '5:1',
		'52' : '5:2',
		'00' : '0:0',
		'11' : '1:1',
		'22' : '2:2',
		'33' : '3:3',
		'01' : '0:1',
		'02' : '0:2',
		'12' : '1:2',
		'03' : '0:3',
		'13' : '1:3',
		'23' : '2:3',
		'04' : '0:4',
		'14' : '1:4',
		'24' : '2:4',
		'05' : '0:5',
		'15' : '1:5',
		'25' : '2:5'
	},
	9004 : {
		'33' : '胜-胜',
		'31' : '胜-平',
		'30' : '胜-负',
		'13' : '平-胜',
		'11' : '平-平',
		'10' : '平-负',
		'03' : '负-胜',
		'01' : '负-平',
		'00' : '负-负'
	},
	11005 : {
		'33' : '胜-胜',
		'31' : '胜-平',
		'30' : '胜-负',
		'13' : '平-胜',
		'11' : '平-平',
		'10' : '平-负',
		'03' : '负-胜',
		'01' : '负-平',
		'00' : '负-负'
	},
	10001 : {
		'2' : '主负',
		'1' : '主胜'
	},
	10002 : {
		'2' : '主负',
		'1' : '主胜'
	},
	10003 : {
		'11' : '客胜1-5',
		'12' : '客胜6-10',
		'13' : '客胜11-15',
		'14' : '客胜16-20',
		'15' : '客胜21-25',
		'16' : '客胜26+',
		'01' : '主胜1-5',
		'02' : '主胜6-10',
		'03' : '主胜11-15',
		'04' : '主胜16-20',
		'05' : '主胜21-25',
		'06' : '主胜26+'
	},
	10004 : {
		'1' : '大分',
		'2' : '小分'
	}
};
var getMatchName = function(num) {
	if (num && num.length == 4) {// 竞彩
		return num.replace(/([1-7])\d{3}/gi, function(match) {
			return matchDic[match.charAt(0)] + match.substring(1);
		});
	}
	return num;
};
/**
 * 
 * @param ticketCode 
 * 	20150506|3301|12/20150506|3302|12,01    
 * 	20150506|3301|10001@2/20150506|3302|10003@12    20150506|3301|10003@12,01/20150506|3302|10004@1,2
 * @param oddsList 3301|12=6.40/3302|01=4.20,12=7.05
 * @param rangqiu  3302=-6.5/3301=-5.5
 * @param playid
 * @returns json
 */
function getPrintNumberFormat(ticketCode,oddsList,rangqiu,playid,lotCode){
	var ticketCodes=ticketCode.split("/");
	var jsonStr="[";
	for(var i=0;i<ticketCodes.length;i++){
		if(i==0) jsonStr+='{';
		else jsonStr+=',{';
		var allNumber = ticketCodes[i].split('|');
		var matchNum=allNumber[1];//赛事编码
		if(matchNum.length==4){//竞彩
			jsonStr+='"ssbh":"'+getMatchName(matchNum)+'"';// 星期编码
		}else if(lotCode==11 && matchNum.length()<100){//北单
			jsonStr+='"ssbh":"'+matchDir(matchNum)+'"';
		}else{
			jsonStr+='"ssbh":"'+matchNum+'"';
		}
		var curPlayId=playid;
		if (playid == 9006|| playid == 10005) {
			var eachNumber = allNumber[2].split("@");
			curPlayId = eachNumber[0];
			var currPlayOdds = eachNumber[1].split(",");
			jsonStr+=',"tzNrs":[';
			for(var jj=0;jj<currPlayOdds.length;jj++){
				if(jj==0) jsonStr+='{';
				else jsonStr+=',{';
				var currPlayOdd=currPlayOdds[jj];
				jsonStr+='"neiRong":"'+dic[curPlayId][currPlayOdd]+'"';//竞猜内容
				jsonStr+=',"peiL":"'+getMyOdds(matchNum,currPlayOdd,oddsList)+'"';//赔率
				jsonStr+='}';
			}
			jsonStr+=']';
		}else{
			var currPlayOdds = allNumber[2].split(",");
			jsonStr+=',"tzNrs":[';
			for(var jj=0;jj<currPlayOdds.length;jj++){
				if(jj==0) jsonStr+='{';
				else jsonStr+=',{';
				var currPlayOdd=currPlayOdds[jj];
				jsonStr+='"neiRong":"'+dic[curPlayId][currPlayOdd]+'"';//竞猜内容
				jsonStr+=',"peiL":"'+getMyOdds(matchNum,currPlayOdd,oddsList)+'"';//赔率
				jsonStr+='}';
			}
			jsonStr+=']';
		}
		if(curPlayId==9001){
			jsonStr+=',"zdrfsIndexStr":"让球数"';
			jsonStr+=',"zdrfs":"'+getMyRangqiu(matchNum,rangqiu)+'"';//主队 让球数 让分数
		}else if(curPlayId==10002){
			jsonStr+=',"zdrfsIndexStr":"让分数"';
			jsonStr+=',"zdrfs":"'+getMyRangqiu(matchNum,rangqiu)+'"';//主队 让球数 让分数
		}else if(curPlayId==10004){
			jsonStr+=',"zdrfsIndexStr":"预设总分"';
			jsonStr+=',"zdrfs":"'+getMyRangqiu(matchNum,rangqiu)+'"';//主队 让球数 让分数
		}else{
			jsonStr+=',"zdrfsIndexStr":""';
			jsonStr+=',"zdrfs":""';//主队 让球数 让分数
		}
		
		jsonStr+='}';
	}
	jsonStr+=']';
	return jsonStr;
}
/**
 *  获取赔率
 * @param matchNum 赛事编码
 * @param playNum 投注内容
 * @param oddsList 赔率列表 3301|12=6.40/3302|01=4.20,12=7.05
 */
function getMyOdds(matchNum,currPlayOdd,oddsList){
	if(!oddsList || oddsList=="")
		return "";
	var oddsLists=oddsList.split("/");
	for(var ii=0;ii<oddsLists.length;ii++){
		var oddsListsIns=oddsLists[ii].split("|");
		if(matchNum==oddsListsIns[0]){
			var oddsListsInsPlays=oddsListsIns[1].split(",");
			for(var jj=0;jj<oddsListsInsPlays.length;jj++){
				var vvr=oddsListsInsPlays[jj].split("=");
				if(vvr[0]==currPlayOdd)
					return vvr[1];
			}
		}
	}
	return "";
}
/**
 * 获取 让球 让分
 * @param matchNum
 * @param rangqiu 让分列表 3302=-6.5/3301=-5.5
 * @returns
 */
function getMyRangqiu(matchNum,rangqiu){
	if(!rangqiu || rangqiu=="")
		return "";
	var rangqius=rangqiu.split("/");
	for(var ii=0;ii<rangqius.length;ii++){
		var rangqiusIns=rangqius[ii].split("=");
		if(matchNum==rangqiusIns[0]){
			return rangqiusIns[1];
		}
	}
	return "";
}